index.org
#+TITLE: krvkir's weblog

Not much here for now.

Hey.

* Notes

** <2017-07-25 Tue> Jupyterlab useful links

Extensions:
- https://github.com/jupyterlab/jupyter-renderers.git

Commands:
- all things are done via =jupyter labextension=, see =jupyter labextension --help-all= for options

** <2017-07-26 Wed> Jupyterlab: enabling ipywidgets

Finally managed to install it (see this [[https://github.com/jupyterlab/jupyterlab/issues/2485][issue]] on =jupyterlab='s github):
#+BEGIN_SRC bash
jupyter labextension install @jupyter-widgets/jupyterlab-manager
#+END_SRC

** <2017-07-26 Wed> Spacemacs: switch back to vim mode from emacs mode

It's just =ctrl-z=. This switches modes from emacs to vim and back.

** <2017-07-27 Thu> Dask progressbar with =tqdm=

Found [[https://github.com/tqdm/tqdm/issues/278][here]].

** <2017-08-04 Fri> Vimperator, customize set of symbols which appear on link hints

It's often sufficient to know the names of things to find how to handle with them:
#+BEGIN_SRC bssh
:set hintchars=qwertasdfgzxcvb
#+END_SRC

Source: [[https://superuser.com/questions/521062/how-to-change-characters-used-for-link-hints-in-firefox-vimperator][StackOverflow]]


* Things to do :noexport:

- [ ] Configure =Jekyll= for good appearence 
- [ ] Add =Disqus= reply form (see [[http://sgeos.github.io/jekyll/disqus/2016/02/14/adding-disqus-to-a-jekyll-blog.html][this]] or [[http://www.perfectlyrandom.org/2014/06/29/adding-disqus-to-your-jekyll-powered-github-pages/][this]] for a manual)
