index.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgef05daf">1. Notes</a>
<ul>
<li><a href="#org5798736">1.1. <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-07-25 Tue&gt; </span></span> Jupyterlab useful links</a></li>
<li><a href="#org94ff165">1.2. <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-07-26 Wed&gt; </span></span> Jupyterlab: enabling ipywidgets</a></li>
<li><a href="#orgc3f5e71">1.3. <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-07-26 Wed&gt; </span></span> Spacemacs: switch back to vim mode from emacs mode</a></li>
<li><a href="#org8015c6e">1.4. <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-07-27 Thu&gt; </span></span> Dask progressbar with <code>tqdm</code></a></li>
<li><a href="#org7b0b167">1.5. <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-08-04 Fri&gt; </span></span> Vimperator, customize set of symbols which appear on link hints</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Not much here for now.
</p>

<p>
Hey.
</p>

<div id="outline-container-orgef05daf" class="outline-2">
<h2 id="orgef05daf"><span class="section-number-2">1</span> Notes</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org5798736" class="outline-3">
<h3 id="org5798736"><span class="section-number-3">1.1</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-07-25 Tue&gt; </span></span> Jupyterlab useful links</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Extensions:
</p>
<ul class="org-ul">
<li><a href="https://github.com/jupyterlab/jupyter-renderers.git">https://github.com/jupyterlab/jupyter-renderers.git</a></li>
</ul>

<p>
Commands:
</p>
<ul class="org-ul">
<li>all things are done via <code>jupyter labextension</code>, see <code>jupyter labextension --help-all</code> for options</li>
</ul>
</div>
</div>

<div id="outline-container-org94ff165" class="outline-3">
<h3 id="org94ff165"><span class="section-number-3">1.2</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-07-26 Wed&gt; </span></span> Jupyterlab: enabling ipywidgets</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Finally managed to install it (see this <a href="https://github.com/jupyterlab/jupyterlab/issues/2485">issue</a> on <code>jupyterlab</code>'s github):
</p>
<div class="org-src-container">
<pre class="src src-bash">jupyter labextension install @jupyter-widgets/jupyterlab-manager
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3f5e71" class="outline-3">
<h3 id="orgc3f5e71"><span class="section-number-3">1.3</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-07-26 Wed&gt; </span></span> Spacemacs: switch back to vim mode from emacs mode</h3>
<div class="outline-text-3" id="text-1-3">
<p>
It's just <code>ctrl-z</code>. This switches modes from emacs to vim and back.
</p>
</div>
</div>

<div id="outline-container-org8015c6e" class="outline-3">
<h3 id="org8015c6e"><span class="section-number-3">1.4</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-07-27 Thu&gt; </span></span> Dask progressbar with <code>tqdm</code></h3>
<div class="outline-text-3" id="text-1-4">
<p>
Found <a href="https://github.com/tqdm/tqdm/issues/278">here</a>.
</p>
</div>
</div>

<div id="outline-container-org7b0b167" class="outline-3">
<h3 id="org7b0b167"><span class="section-number-3">1.5</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-08-04 Fri&gt; </span></span> Vimperator, customize set of symbols which appear on link hints</h3>
<div class="outline-text-3" id="text-1-5">
<p>
It's often sufficient to know the names of things to find how to handle with them:
</p>
<div class="org-src-container">
<pre class="src src-bssh">:set hintchars=qwertasdfgzxcvb
</pre>
</div>

<p>
Source: <a href="https://superuser.com/questions/521062/how-to-change-characters-used-for-link-hints-in-firefox-vimperator">StackOverflow</a>
</p>
</div>
</div>
</div>
